--[[
 ________  ___  ___  ________   ________  ___  ___  ___     
|\   ____\|\  \|\  \|\   ___  \|\   ____\|\  \|\  \|\  \    
\ \  \___|\ \  \\\  \ \  \\ \  \ \  \___|\ \  \\\  \ \  \   
 \ \_____  \ \  \\\  \ \  \\ \  \ \_____  \ \   __  \ \  \  
  \|____|\  \ \  \\\  \ \  \\ \  \|____|\  \ \  \ \  \ \  \ 
    ____\_\  \ \_______\ \__\\ \__\____\_\  \ \__\ \__\ \__\
   |\_________\|_______|\|__| \|__|\_________\|__|\|__|\|__|
   \|_________|                   \|_________|              
]]--

local PLUGIN = PLUGIN

PLUGIN.name = "Круглый HUD для Helix"
PLUGIN.author = "kido"
PLUGIN.description = "Современный HUD с тремя круглыми индикаторами для здоровья, брони и выносливости + отображение патронов справа."
PLUGIN.requires = {}

ix.config.Add("basicHealthBar", false, "Заменить полосу здоровья на упрощённую.", nil, {
    category = "Helix HUD"
})

if SERVER then
    AddCSLuaFile("ui/cl_hud.lua")
else 
    include("ui/cl_hud.lua")
end
